Revit 2024 API
DeleteElements Methods
The DeleteElements type exposes the following members.
Methods
Name | Description
Create(Document, ElementId)
 Creates an instance of the DeleteElements resolution.
Create(Document, IList<ElementId>)
 Creates an instance of the DeleteElements resolution.
Create(Document, ISet<ElementId>)
 Creates an instance of the DeleteElements resolution.
Dispose |  (Inherited from FailureResolution.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DeleteElements Class
Autodesk.Revit.DB Namespace